driver-tests/pojose/wikiSamples/04_POJO2BPEL_JAXB/caCreditReport/src/jbiasa/caCreditReport.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="caCreditReport"
             xmlns:tns="caCreditReport" xmlns:ns="http://crpt.sun.com/POJOCreditReportSvcs/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://crpt.sun.com/POJOCreditReportSvcs/" location="../jbiServiceUnits/jseCreditReport/com/sun/crpt/POJOCreditReportSvcs.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:POJOCreditReportSvcsInterface">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="POJOCreditReportSvcsOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="caCreditReport"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="caCreditReport"/>
            </output>
        </operation>
    </binding>
    <service name="casaService1">
        <port name="pojoCreditReport" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/casaService1/pojoCreditReport"/>
        </port>
    </service>
</definitions>
