driver-tests/pojose/wikiSamples/04_POJO2BPEL_JAXB/caCreditReport/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cac="caCreditReport">
  <soapenv:Body>
    <cac:POJOCreditReportSvcsOperation>
      <part1>John</part1>
    </cac:POJOCreditReportSvcsOperation>
  </soapenv:Body>
</soapenv:Envelope>